delivery/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."supplier_id" = 1
---
  def index
    @clients

    if current_user
      @clients = current_user.supplier.clients
    else
      @clients = Client.all

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @client = Client.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO "clients" ("address", "contact", "created_at", "email", "name", "phone", "rut", "supplier_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(params[:client])
    @client.supplier_id = current_user.supplier.id

    respond_to do |format|
      if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "rut" = '19000000', "updated_at" = '2012-09-27 20:46:24.427849' WHERE "clients"."id" = 1
---
  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 2]]
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy