delivery/app/controllers/orders_controller.rb

  def index
    @orders = Order.last_twenty
    @q = Order.search(params[:q])
---
SELECT "orders".* FROM "orders"

  def new
    @order    = Order.new
    @order.invoice_number = Order.last.blank? ? 1 : Order.last.invoice_number + 1
    @clients  = current_user.supplier.clients
    @products = Product.where(:supplier_id => current_user.supplier.id)
---
SELECT "clients".* FROM "clients" WHERE "clients"."supplier_id" = 1

  def edit
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @order = Order.new(params[:order])
    @order.user = current_user
    unless params[:id_client].blank?
      @order.client_id = params[:id_client]
    end
    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("client_id", "created_at", "delivery_address", "due_date", "notes", "number", "supplier_id", "total", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @order = Order.find(params[:id])
    @clients = current_user.supplier.clients
    @products = ProductOrder.where(:order_id => @order.id)
    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "orders" SET "delivery_address" = 'Buenos Aires 121', "updated_at" = '2012-09-27 20:46:49.991361' WHERE "orders"."id" = 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]