delivery/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."supplier_id" = 1
---
  def index
     @products

    if current_user
      @products = current_user.supplier.clients
    else
      @products = Product.all

INSERT INTO "products" ("created_at", "description", "name", "price", "supplier_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])
    @product.supplier_id = current_user.supplier.id

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "description" = 'white pencil uni', "updated_at" = '2012-09-27 20:47:13.385373' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])