app/controllers/suppliers_controller.rb

  def index
    @suppliers = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @supplier = Supplier.new(params[:supplier])

    respond_to do |format|
      if @supplier.save
---
INSERT INTO "suppliers" ("address", "contact_person", "created_at", "email", "last_order_number", "name", "phone", "rut", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @supplier = Supplier.find(params[:id])

    respond_to do |format|
      if @supplier.update_attributes(params[:supplier])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "suppliers" SET "phone" = '29101010', "address" = '', "updated_at" = '2012-09-27 20:47:35.833584' WHERE "suppliers"."id" = 2

  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = ?  [["id", 2]]